In [1]:
import pandas as pd

In [2]:
#merging
#concate
#append

In [3]:
#concate-------
a=[1,2,3,4]
b=[5,6,7,8]
c=a+b
c

[1, 2, 3, 4, 5, 6, 7, 8]

In [4]:
# append-----
a=[23,45,67,54,12,90]
a.append('hello bhai')

In [5]:
a

[23, 45, 67, 54, 12, 90, 'hello bhai']

In [6]:
a=[3,4,5,7]
b=[-2,4,76,3,1]
a.append(b)

In [7]:
a

[3, 4, 5, 7, [-2, 4, 76, 3, 1]]

In [8]:
# merging-----
x={
    'name':['q'],
    'age':[20],
    'hobby':['study']
}

In [9]:
y={
    'age':[20],
    'hobby':['music']
}

In [10]:
a=pd.DataFrame(x)
b=pd.DataFrame(y)

In [11]:
a

  name  age  hobby
0    q   20  study

In [12]:
b

   age  hobby
0   20  music

In [13]:
pd.merge(a,b,how='left')

  name  age  hobby
0    q   20  study

In [14]:
pd.merge(a,b,how='right')

  name  age  hobby
0  NaN   20  music

In [15]:
pd.merge(a,b,how='outer')

  name  age  hobby
0    q   20  study
1  NaN   20  music

In [16]:
pd.merge(a,b,how='inner')

Empty DataFrame
Columns: [name, age, hobby]
Index: []

In [17]:
pd.merge(a,b,how='cross')

  name  age_x hobby_x  age_y hobby_y
0    q     20   study     20   music